<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Email template</title>
</head>
<body style="background: linear-gradient(to bottom right, #66A6D2, #E64557); margin: 0;">
	<div class="container" style="">
		<div class="header" style="height: 140px;">
			<div class="book-icon" style="text-align: center; padding-top: 10px;">
				<img src="https://viebook.ru/images/logo.png" width="60" height="60">
			</div>
			<div class="logo" style="text-align: center; color: white; line-height: 50px; font-size: 40px; font-weight: 100;">VieBook</div>    
		</div>
		<br>
		<div class="wrap" style="box-shadow: 1px 1px 2px white;background: white;border-radius: 10px;font-size: 17px;margin-bottom: 50px; width: 80%; margin: 0 auto;">
			<div class="title-photo" style="margin: 0; padding: 0; background: url(https://viebook.ru/images/photo_for_email.jpg) no-repeat; background-size: cover; width: 100%; height: 200px; border-radius: 10px 10px 0 0;">
				<div style="color: white; text-align: center; font-size: 35px; padding-top: 8%">Программисты не читают книги, должны ли вы?</div>
			</div>
			<div class="content" style="color: #444; font-size: 20px; padding-top: 10px; line-height: 1.2em; width: 97%; margin: 0 auto;">
				Одной из основных тем на stackoverflow.com является “Почему программисты больше не изучают программирование по книгам”, как высказывался Джоел Спольски:

				<blockquote style="margin-left: 0px; padding-left: 20px; border-left: 5px solid #98a2b1;">
					Похоже, что программисты перестали читать книги. Рынок книг по программированию мизерный, если сравнивать с количеством работающих программистов.
				</blockquote>

				<br>

				Джоель выражал подобное отношение еще в 2004:

				<blockquote style="margin-left: 0px; padding-left: 20px; border-left: 4px solid #98a2b1;">
					Но большинство людей до сих пор не читают. Или пишут. Большинство разработчиков не читают книги о программной обеспечении, они не читают веб-сайты о программном обеспечении, они даже не читают Slashdot (англоязычный новостной сайт, специализирующийся на технических и интересных технической аудитории темах. - Википедия).
				</blockquote> 

				<br>

				Если программисты сейчас не учатся по книгам, как они вообще учатся программировать? Они делают это старомодным способом: Засучив рукава пишут код, используя всю мудрость интернета во втором окне. Интернет позиционирует книги по программированию устаревшими. Это быстрее, эффективнее и просто разумнее черпать информацию из интернета.

				<br><br>

				Я возлагаю часть вины прямо на ноги технической книгоиздательской индустрии:

				<ol>
					<li>
						<b>Большинство книг по программированию - дерьмо.</b>
						Барьер для того, чтобы стать автором книги, как я могу судить, практически отсутствует. Сигнал к распространению книгоиздания, возможно, не намного лучше того, что вы найдете в дебрях интернета. Из сотен книг по программированию, выпускающихся каждый год, возможно две или три стоят траты времени.
					</li>
					<br>
					<li>
						<b>Книги по программированию продаются по весу, а не по ценности.</b>
						Существует, видимо, обратная связь между размером книги и ее качеством. Чем больше книга, так или иначе, тем меньше в ней полезной информации. В чем смысл существования подобных книг? Быть справочными гигантами? Как вы находите что-нибудь в них? Быстрое создание книг, ориентированных на новичков. Не имею ничего против того, чтобы в сферу программирование приходили новые люди. Но я продолжаю верить, что разнообразие книг типа “Изучаем [вставить ЯП] за 24 часа!” вредит нашей профессии. Маниакальный фокус на “прямо сейчас”, быстром, самом простом способе делать вещи ведет начинающих путем, полным иллюзий.
					</li>
					<br>
					<li>
						<b>Порнография книги о программировании.</b>
						Идея того, что наличие кучи толстых, важных книг, пылящихся на полке, в значительной степени непрочитанных, каким-то образом сделает вас лучшим программистом. Как мне писал знакомый со стажем, прочитав несколько книг о теории программирования “Я никогда не делал этого в реальной жизни и не стал бы”, походит на обсуждение извращенных способов из сферы программирования. По этой причине я обдумал и отказался от покупки книги Кнута “Искусство программирования”. Старайтесь покупать практические книги, которые вы на самом деле прочитаете, и что более важно, примените знания на практике. Во времена, когда книги по программированию выпускают в большом количестве, очень важно быстро и правильно определить на что стоит тратить свое время и деньги.
					</li>
				</ol>

				<br>

				Интернет, безусловно, ускорил конец книг по программированию, которые не дают того, чего от них ожидаешь, но есть некоторые свидетельства того, что даже до зарождения интернета программисты не читали всего этого множества литературы.

				<br>
				<br>

				Сейчас выбор книги кажется разумным исходя из рекомендаций опытных программистов, но даже эти рекомендации/рецензии сводятся к неинформативной хвальбе. Посмотрите на одну из топовых рецензий на Амазоне, написанный к книге Стива Макконнелла “Совершенный код”:

				<br>
				<br>

				Похлопайте себя по спине за чтение этой книги. Вы уже развиваетесь лучше, чем большинство людей в индустрии программного обеспечения, потому что одна книга это больше, чем большинство программистов читают каждый год. Немного чтения перерастает в долгий путь совершенствования профессиональных навыков. Если вы читаете хотя бы одну хорошую книгу каждые два месяца (примерно по 34 страницы в неделю), вы будете довольно неплохо разбираться в этой отрасли и отличаться почти от всех программистов вокруг вас.

				<br>
				<br>

				Выглядит довольно впечатляюще, не правда ли? Настолько же впечатляюще, как и реклама средства для похудения? И это один из most rated отзывов. Довольно мило, что подобного рода рецензии большинству людей хватает для того, чтобы купить книгу. Никакой аналитики, обзора книги.

				<br>
				<br>

				Просто. Хвалебная. Рекомендация.

				<br>
				<br>

				Статистика чтения частично ошеломляет: Средний разработчик ПО, к примеру, не приобретает ни одной книги по теме, с которой он имеет дело на роботе, и даже не читает таких. Этот факт ужасен для всех, кто обеспокоен качеством работы подобных программистов. Для людей, которые пишут книги, это трагично.

				<br>
				<br>

				Меня немного пугает чтение комментариев на reddit, где люди интерпретируют философию stackoverflow не в пользу книг. Говорят о том, что с приходом этого сайта, книги стали попросту бесполезны. Я люблю книги, так как они являются четко структурированной базой знаний. Но, к сожалению, это не всегда так. Именно поэтому сейчас нужно очень осторожно подходить к выбору книг.

				<br>
				<br>

				Я занимаюсь развитием проекта, в котором разные люди из разных профессиональных областей пытаются донести до Вас основные аспекты книг, рассказать о практической пользе, рассказать кому будет полезной, кому будет вредным читать и на какой уровень знаний читателя опирается книга. Также Вам объяснят на каком этапе развития, как специалиста, вы окажетесь после прочтения конкретной книги.

				<br>
				<br>

				Если у Вас возникает желание отдать/продать/обменять/выкинуть купленные вами книги, поверьте, вы купили не те книги.

				<br>
				<br>

				Я бы низачто не обменял мои книги. Я возвращаюсь к чтению время от времени.

				<br>
				<br>

				Когда я только начинал программировать, я и понятия не имел что же конкретно мне нужно делать. Постоянно тратил время на чтение статей в стиле “Как научится программировать”, “10 must-read книг программиста”, “План по освоению [вставьте ЯП]”, но пользы от этого было не много. Лишь со временем в моей голове вырисовывался примерный план действий. Но это больше похоже на брождение по пустыне, ни в коем случае не на конкретный план действий для достижения ясного результата.

				<br>
				<br>

				Заходите на <a href="http://viebook.ru" style="text-decoration: none; color: #66A6D2 !important;" target="_blank">http://viebook.ru</a>, читайте анализ книг от людей с опытом, которые объяснят практическую пользу книги и выбирайте только то, что совпадает с Вашим карьерным путем!

				<br>
				<br>

				<div style="text-align: center; font-size: 17px; line-height: 1em;">
				&copy; Viebook 2017
				<br>
				All rights reserved.
				</div>
				<br>
			</div>
		</div>
	</div>
</body>
</html>