<?php
$this->title = "О проекте";
?>

<div class="row">

	<div class="col-md-8 col-xs-12">

		<h3 class="text-center">О проекте</h3>

		<p style="font-size: 17px; color: #444; line-height: 1.2em;">
		Сервис Вайбук создан для людей, которым лично нужно убедиться в том, насколько информативна каждая книга и как она повлияет на их карьеру, как специалиста.
		<br><br>
		Мы объединяем людей, которые уже прочитали какую-то книгу и людей, которые только собираются или ищут новую книгу. Вы не будете читать мнение автора, не будете читать отзыв о том, как книга сшита и как приятно ее держать в руках. 
		<br><br>
		Цель обзоров - развеять сомнения на счет выбранной Вами книги и показать, как она повлияет на Вашу карьеру специалиста.
		<br><br>
		Только объективные обзоры профильных книг!
		<br><br>
		Мы стремимся к тому, чтобы Ваш выбор книги не был основан на чьем-то мнении, а исходил из самой важности книги. 
		<br><br>
		Вы сами решаете насколько правильным будет выбор той или иной книги. Мы лишь предоставляем Вам список книг с обзорами, которые улучшат ваши навыки.
		</p>
		<div class="pull-right">
			<b> - Валера Гурачек</b> <small style="color: #333;">(Founder)</small>
		</div>
	</div>
	<div class="col-md-4 about-logo">
		<br>
		<img src="/images/big_logo.png" width="90%" height="90%">
	</div>
</div>